{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v1.7.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, 32, 12, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "time_distributed_input"
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed",
              "trainable": true,
              "batch_input_shape": [null, null, 32, 12, 1],
              "dtype": "float32",
              "layer": {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [12, 12],
                  "strides": [1, 1],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [1, 1],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "BatchNormalization",
                "config": {
                  "name": "batch_normalization",
                  "trainable": true,
                  "dtype": "float32",
                  "axis": [3],
                  "momentum": 0.99,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": { "class_name": "Zeros", "config": {} },
                  "gamma_initializer": { "class_name": "Ones", "config": {} },
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Activation",
                "config": {
                  "name": "activation",
                  "trainable": true,
                  "dtype": "float32",
                  "activation": "relu"
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_3",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_4",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [12, 1],
                  "strides": [1, 1],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [1, 1],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_5",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "BatchNormalization",
                "config": {
                  "name": "batch_normalization_1",
                  "trainable": true,
                  "dtype": "float32",
                  "axis": [3],
                  "momentum": 0.99,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": { "class_name": "Zeros", "config": {} },
                  "gamma_initializer": { "class_name": "Ones", "config": {} },
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_6",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Activation",
                "config": {
                  "name": "activation_1",
                  "trainable": true,
                  "dtype": "float32",
                  "activation": "relu"
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_7",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout_1",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_8",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "GlobalAveragePooling2D",
                "config": {
                  "name": "global_average_pooling2d",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last",
                  "keepdims": false
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_9",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              }
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 100,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 100,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense/kernel", "shape": [100, 100], "dtype": "float32" },
        { "name": "dense/bias", "shape": [100], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [100, 6], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [6], "dtype": "float32" },
        {
          "name": "lstm/lstm_cell/kernel",
          "shape": [64, 400],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel",
          "shape": [100, 400],
          "dtype": "float32"
        },
        { "name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32" },
        {
          "name": "time_distributed/kernel",
          "shape": [12, 12, 1, 64],
          "dtype": "float32"
        },
        { "name": "time_distributed/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "time_distributed_1/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_1/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_1/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_1/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_4/kernel",
          "shape": [12, 1, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_4/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_5/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_5/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_5/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_5/moving_variance",
          "shape": [64],
          "dtype": "float32"
        }
      ]
    }
  ]
}
